{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip",
      "version": "'0abc8f390b278c3b4aabc4c004ac8a088b65cf24'"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer",
      "version": "'b74fab3656eea9de20a9b8116afa3cfc4ec09657'"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp",
      "version": "'cbc7b02bb99fae35cb42f514762b89b5126651ef'"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path",
      "version": "'c642487086dbd9a93160e1679a1327be111cbc25'"
    },
    "cmp_luasnip": {
      "src": "https://github.com/saadparwaiz1/cmp_luasnip",
      "version": "'98d9cb5c2c38532bd9bdb481067b20fea8f32e90'"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets",
      "version": "'6cd7280adead7f586db6fccbd15d2cac7e2188b9'"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'25050e4ed39e628282831d4cbecb1850454ce915'"
    },
    "indent-blankline.nvim": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim",
      "version": "'d28a3f70721c79e3c5f6693057ae929f3d9c0a03'"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/williamboman/mason-lspconfig.nvim",
      "version": "'21c5b3ebeaa0412e28096bb0701434c51c1fbf76'"
    },
    "mason.nvim": {
      "src": "https://github.com/williamboman/mason.nvim",
      "version": "'2a6940af80375532e5e9e7c1f2fc6319a1b7a69d'"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs",
      "version": "'7b9923abad60b903ece7c52940e1321d39eccc79'"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp",
      "version": "'a1d504892f2bc56c2e79b65c6faded2fd21f3eca'"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap",
      "version": "'531771530d4f82ad2d21e436e3cc052d68d7aebb'"
    },
    "nvim-dap-go": {
      "src": "https://github.com/leoluz/nvim-dap-go",
      "version": "'b4421153ead5d726603b02743ea40cf26a51ed5f'"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui",
      "version": "'1a66cabaa4a4da0be107d5eda6d57242f0fe7e49'"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": "'a683e0ddf0cf64c6cd689e18ffb480ade3c162b7'"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio",
      "version": "'21f5324bfac14e22ba26553caf69ec76ae8a7662'"
    },
    "nvim-tree.lua": {
      "src": "https://github.com/nvim-tree/nvim-tree.lua",
      "version": "'fb343438d49fba8c35ecc4829d66fca7a1f0ed3d'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'4916d6592ede8c07973490d9322f187e07dfefac'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons",
      "version": "'dfbfaa967a6f7ec50789bead7ef87e336c1fa63c'"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'74b06c6c75e4eeb3108ec01852001636d85a932b'"
    },
    "rose-pine": {
      "src": "https://github.com/rose-pine/neovim",
      "version": "'ff483051a47e27d84bdef47703538df1ed9f4a47'"
    },
    "telescope-ui-select.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-ui-select.nvim",
      "version": "'6e51d7da30bd139a6950adf2a47fda6df9fa06d2'"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": "'7d324792b7943e4aa16ad007212e6acc6f9fe335'"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive",
      "version": "'3b753cf8c6a4dcde6edee8827d464ba9b8c4a6f0'"
    },
    "vim-rails": {
      "src": "https://github.com/tpope/vim-rails",
      "version": "'b0a5c76f86ea214ade36ab0b811e730c3f0add67'"
    },
    "vim-test": {
      "src": "https://github.com/vim-test/vim-test",
      "version": "'2676d84c6901e484df00b5d728bd6a345d47ee12'"
    },
    "vimux": {
      "src": "https://github.com/preservim/vimux",
      "version": "'d6cb7f63a8bb428ffc27060b7f83c77fb115589c'"
    }
  }
}
